app/Helpers/distancia_helper.php

SELECT *
FROM `tarifas_envio`
WHERE `activo` = 1
ORDER BY `orden` ASC
---
    function calcular_costo_envio($lat_cliente, $lng_cliente, $lat_restaurante = -25.291388888889, $lng_restaurante = -57.718333333333) {
        // Usar la base de datos directamente para obtener las tarifas
        $db = \Config\Database::connect();
        $builder = $db->table('tarifas_envio');
        $tarifas = $builder->where('activo', 1)
                          ->orderBy('orden', 'ASC')
                          ->get()
                          ->getResultArray();