app/Controllers/AuthController.php

SELECT *
FROM `empleados`
WHERE `email` = 'repartidor@test.com'
 LIMIT 1
---
    public function procesarLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Buscar en empleados
        $empleadoModel = new EmpleadoModel();
        $empleado = $empleadoModel->where('email', $email)->first();