app/Controllers/CheckoutController.php

INSERT INTO `pedidos` (`nombre`, `correo_electronico`, `celular`, `fecha`, `estado`, `estado_pago`, `total`, `metodo_pago`, `observaciones`, `direccion_entrega`, `entre`, `indicacion`, `codigo_seguimiento`, `latitud`, `longitud`) VALUES ('Prueba', 'admin@sisie.com', '371800000', '2025-07-29 12:39:45', 'pendiente', 'pendiente', 1600, 'efectivo', '', 'Juan José Castelli 745, P3610DIK Clorinda, Formosa, Argentina', '', '', 'A9312FD7', '-25.281522', '-57.729898500000004')
---

        // Guardar pedido
        $pedidoModel = new PedidoModel();
        $pedidoId = $pedidoModel->insert($pedidoData);