app/Controllers/CheckoutController.php


        // Guardar pedido
        $pedidoModel = new \App\Models\PedidoModel();
        $pedidoId = $pedidoModel->insert($pedidoData);
---
INSERT INTO `pedidos` (`nombre`, `correo_electronico`, `celular`, `fecha`, `estado`, `estado_pago`, `total`, `costo_envio`, `metodo_pago`, `observaciones`, `direccion_entrega`, `entre`, `indicacion`, `codigo_seguimiento`, `latitud`, `longitud`) VALUES ('Xiaomi 14T', '', '371800000', '2025-08-09 02:52:05', 'pendiente', 'pendiente', 8500, '1500.00', 'efectivo', '', 'Juan José Castelli 766, P3610DIL Clorinda, Formosa, Argentina', '', '', '14440E80', '-25.281536', '-57.729238')