app/Controllers/MenuController.php

SELECT *
FROM `productos`
WHERE `activo` = 1
ORDER BY RAND()
 LIMIT 4
SELECT *
FROM `combos`
WHERE `activo` = 1
ORDER BY RAND()
 LIMIT 4
---
    public function index()
    {
        $productoModel = new ProductoModel();
        $comboModel = new ComboModel();
        $categoriaModel = new CategoriaModel();

        // Obtener categorías con sus productos
        $categoriasConProductos = $categoriaModel->getCategoriasConProductos();

        // Obtener productos activos agrupados por tipo (para mantener compatibilidad)
        $comidas = $productoModel->getByTipo('comida');
        $bebidas = $productoModel->getByTipo('bebida');
        $viandas = $productoModel->getByTipo('vianda');
        $combos = $comboModel->getAllActivos();

        // Obtener productos destacados (aleatorios para mostrar variedad)
        $productosDestacados = $productoModel->where('activo', 1)
            ->orderBy('RAND()')
            ->findAll(4);

        // Obtener combos destacados
        $combosDestacados = $comboModel->where('activo', 1)
            ->orderBy('RAND()')
            ->findAll(4);