app/Controllers/SeguimientoController.php

    public function seguimiento($codigo_seguimiento = null)
    {
        if (!$codigo_seguimiento) {
            $data = [
                'title' => 'Seguir mi Pedido'
            ];

            return view('header', $data)
                . view('navbar')
                . view('seguimiento/buscar_pedido')
                . view('footer');
        }

        // Obtener pedido con información del repartidor
        $pedido = $this->pedidoModel
            ->select('pedidos.*, repartidores.nombre as repartidor_nombre')
            ->join('repartidores', 'repartidores.id = pedidos.repartidor_id', 'left')
            ->where('pedidos.codigo_seguimiento', $codigo_seguimiento)
            ->first();
---
SELECT `pedidos`.*, `repartidores`.`nombre` as `repartidor_nombre`
FROM `pedidos`
LEFT JOIN `repartidores` ON `repartidores`.`id` = `pedidos`.`repartidor_id`
WHERE `pedidos`.`codigo_seguimiento` = '14440E80'
 LIMIT 1