app/Models/CategoriaModel.php

SELECT `c`.*, `p`.`id` as `producto_id`, `p`.`nombre` as `producto_nombre`, `p`.`descripcion` as `producto_descripcion`, `p`.`precio` as `producto_precio`, `p`.`imagen` as `producto_imagen`, `p`.`tipo` as `producto_tipo`, `p`.`activo` as `producto_activo`
FROM `categorias` `c`
LEFT JOIN `productos` `p` ON `c`.`id` = `p`.`categoria_id` AND `p`.`activo` = 1
WHERE `c`.`activo` = 1
ORDER BY `c`.`orden` ASC, `c`.`nombre` ASC, `p`.`nombre` ASC
---
    public function getCategoriasConProductos(): array
    {
        $db = \Config\Database::connect();
        $builder = $db->table('categorias c');
        $builder->select('c.*,
                         p.id as producto_id,
                         p.nombre as producto_nombre,
                         p.descripcion as producto_descripcion,
                         p.precio as producto_precio,
                         p.imagen as producto_imagen,
                         p.tipo as producto_tipo,
                         p.activo as producto_activo');
        $builder->join('productos p', 'c.id = p.categoria_id AND p.activo = 1', 'left');
        $builder->where('c.activo', 1);
        $builder->orderBy('c.orden', 'asc');
        $builder->orderBy('c.nombre', 'asc');
        $builder->orderBy('p.nombre', 'asc');

        $result = $builder->get()->getResultArray();