app/Models/ComboModel.php

    public function getAllActivos(): array
    {
        return $this->where('activo', 1)
                    ->orderBy('nombre', 'asc')
                    ->findAll();
---
SELECT *
FROM `combos`
WHERE `activo` = 1
ORDER BY `nombre` ASC