app/Models/ConfiguracionModel.php

    public function getValor($clave, $default = null)
    {
        $config = $this->where('clave', $clave)
                      ->where('activo', 1)
                      ->first();
---
SELECT *
FROM `configuracion`
WHERE `clave` = 'logo_icon'
AND `activo` = 1
 LIMIT 1

    public function getPorSeccion($seccion)
    {
        return $this->where('seccion', $seccion)
                   ->where('activo', 1)
                   ->findAll();
---
SELECT *
FROM `configuracion`
WHERE `seccion` = 'footer'
AND `activo` = 1