app/Models/DetallePedidoModel.php

SELECT `dp`.*, `p`.`nombre` as `producto_nombre`, `p`.`imagen` as `producto_imagen`, `c`.`nombre` as `combo_nombre`, `c`.`imagen` as `combo_imagen`
FROM `detalles_pedido` `dp`
LEFT JOIN `productos` `p` ON `p`.`id` = `dp`.`producto_id`
LEFT JOIN `combos` `c` ON `c`.`id` = `dp`.`combo_id`
WHERE `dp`.`pedido_id` = 35
---
    public function getDetallesConInfo(int $pedido_id): array
    {
        $builder = $this->db->table('detalles_pedido dp');
        $builder->select('dp.*, p.nombre as producto_nombre, p.imagen as producto_imagen, c.nombre as combo_nombre, c.imagen as combo_imagen');
        $builder->join('productos p', 'p.id = dp.producto_id', 'left');
        $builder->join('combos c', 'c.id = dp.combo_id', 'left');
        $builder->where('dp.pedido_id', $pedido_id);

        $result = $builder->get()->getResultArray();