app/Models/PedidoModel.php

    public function getByCodigoSeguimiento(string $codigo): ?array
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pedidos p');
        $builder->select('p.*');
        $builder->where('p.codigo_seguimiento', $codigo);
        $result = $builder->get()->getRowArray();
---
SELECT `p`.*
FROM `pedidos` `p`
WHERE `p`.`codigo_seguimiento` = '14440E80'