app/Models/ProductoModel.php

    public function getByTipo(string $tipo): array
    {
        return $this->where('activo', 1)
                    ->where('tipo', $tipo)
                    ->orderBy('nombre', 'asc')
                    ->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1
AND `tipo` = 'comida'
ORDER BY `nombre` ASC

    public function getById(int $id): ?array
    {
        return $this->where('id', $id)
                    ->where('activo', 1)
                    ->first();
---
SELECT *
FROM `productos`
WHERE `id` = 3
AND `activo` = 1
 LIMIT 1