app/Models/SlideModel.php

SELECT *
FROM `slides`
WHERE `activo` = 1
ORDER BY `orden` ASC
---
    public function getSlidesActivos()
    {
        return $this->where('activo', 1)
                   ->orderBy('orden', 'ASC')
                   ->findAll();